app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["priority", 1], ["updated_at", "2023-03-24 13:39:55.891656"], ["id", 1]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)